; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 - counter
	)
  (:init
		(= (value c0) 5)
	(= (value c1) 35)
	(= (value c2) 51)
	(= (value c3) 63)
	(= (value c4) 36)
	(= (value c5) 22)
	(= (value c6) 47)
	(= (value c7) 87)
	(= (value c8) 26)
	(= (value c9) 68)
	(= (value c10) 93)
	(= (value c11) 51)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
		)
	)
)

; plan
1. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 11
2. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 11
3. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 11
4. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 11
5. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 11
6. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 11
7. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 11
8. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 11
9. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 11
10. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 11
11. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 11
12. (increment c8)
   changed: (value c8) from 26 to 33
   goals met: 7 of 11
13. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 11
14. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 11
15. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 11
16. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 11
17. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 11
18. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 11
19. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 11
20. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 11
21. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 7 of 11
22. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 7 of 11
23. (increment c11)
   changed: (value c11) from 51 to 58
   goals met: 7 of 11
24. (increment c11)
   changed: (value c11) from 58 to 65
   goals met: 7 of 11
25. (increment c11)
   changed: (value c11) from 65 to 72
   goals met: 7 of 11
26. (increment c11)
   changed: (value c11) from 72 to 79
   goals met: 7 of 11
27. (increment c11)
   changed: (value c11) from 79 to 86
   goals met: 7 of 11
28. (increment c11)
   changed: (value c11) from 86 to 93
   goals met: 7 of 11
29. (increment c11)
   changed: (value c11) from 93 to 100
   goals met: 8 of 11
30. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 8 of 11
31. (increment c8)
   changed: (value c8) from 33 to 41
   goals met: 8 of 11
32. (increment c8)
   changed: (value c8) from 41 to 49
   goals met: 8 of 11
33. (increment c8)
   changed: (value c8) from 49 to 57
   goals met: 8 of 11
34. (increment c8)
   changed: (value c8) from 57 to 65
   goals met: 8 of 11
35. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 8 of 11
36. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 8 of 11
37. (increment c8)
   changed: (value c8) from 65 to 75
   goals met: 7 of 11
38. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 11
39. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 11
40. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 11
41. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 7 of 11
42. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 7 of 11
43. (increment c5)
   changed: (value c5) from 22 to 27
   goals met: 7 of 11
44. (increment c5)
   changed: (value c5) from 27 to 32
   goals met: 7 of 11
45. (increment c5)
   changed: (value c5) from 32 to 37
   goals met: 8 of 11
46. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 8 of 11
47. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 8 of 11
48. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 11
49. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 8 of 11
50. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 11
51. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 11
52. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 8 of 11
53. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 8 of 11
54. (increment c4)
   changed: (value c4) from 36 to 41
   goals met: 7 of 11
55. (increment c4)
   changed: (value c4) from 41 to 46
   goals met: 7 of 11
56. (increment c5)
   changed: (value c5) from 37 to 42
   goals met: 7 of 11
57. (increment c5)
   changed: (value c5) from 42 to 47
   goals met: 7 of 11
58. (increment c4)
   changed: (value c4) from 46 to 51
   goals met: 6 of 11
59. (increment c4)
   changed: (value c4) from 51 to 56
   goals met: 6 of 11
60. (increment c5)
   changed: (value c5) from 47 to 52
   goals met: 6 of 11
61. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 6 of 11
62. (increment c4)
   changed: (value c4) from 56 to 61
   goals met: 6 of 11
63. (decrement c3)
   changed: (value c3) from 63 to 60
   goals met: 7 of 11
64. (decrement c8)
   changed: (value c8) from 75 to 65
   goals met: 8 of 11
65. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 8 of 11
66. (decrement c7)
   changed: (value c7) from 87 to 82
   goals met: 8 of 11
67. (decrement c7)
   changed: (value c7) from 82 to 77
   goals met: 8 of 11
68. (increment c8)
   changed: (value c8) from 65 to 75
   goals met: 7 of 11
69. (decrement c7)
   changed: (value c7) from 77 to 72
   goals met: 8 of 11
70. (decrement c8)
   changed: (value c8) from 75 to 65
   goals met: 8 of 11
71. (decrement c7)
   changed: (value c7) from 72 to 67
   goals met: 8 of 11
72. (decrement c7)
   changed: (value c7) from 67 to 62
   goals met: 9 of 11
73. (decrement c5)
   changed: (value c5) from 52 to 46
   goals met: 10 of 11
74. (decrement c4)
   changed: (value c4) from 61 to 56
   goals met: 9 of 11
75. (decrement c3)
   changed: (value c3) from 60 to 57
   goals met: 9 of 11
76. (decrement c3)
   changed: (value c3) from 57 to 54
   goals met: 10 of 11
77. (increment c5)
   changed: (value c5) from 46 to 52
   goals met: 9 of 11
78. (increment c5)
   changed: (value c5) from 52 to 58
   goals met: 10 of 11
79. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 10 of 11
80. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 10 of 11
81. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 10 of 11
82. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 10 of 11
83. (increment c6)
   changed: (value c6) from 47 to 51
   goals met: 10 of 11
84. (increment c6)
   changed: (value c6) from 51 to 55
   goals met: 10 of 11
85. (increment c6)
   changed: (value c6) from 55 to 59
   goals met: 11 of 11
